micropython/micropython/ports/samd/boards/PYCUBED_MINI_V04/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "PyCubed Mini V4"
#define MICROPY_HW_MCU_NAME "samd51J19A"
#define MICROPY_HW_XOSC32K          (1)
